/* eslint-disable max-len */
const data = [
  {
    index: 1,
    label: 'Технологии',
    eventsList: [
      {
        index: 1,
        year: 1980,
        description: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        index: 2,
        year: 1982,
        description:
          'Появился домашний компьютер ZX Spectrum в двух вариантах — с 16 и 48 килобайтами оперативной памяти',
      },
      {
        index: 3,
        year: 1984,
        description:
          'С июня 1984 года разработчики готовили ZX Spectrum+, который был выпущен в октябре того же года',
      },
      {
        index: 4,
        year: 1986,
        description:
          'После приобретения бренда «Sinclair» компания «Amstrad» выпустила ZX Spectrum +2',
      },
    ],
  },
  {
    index: 2,
    label: 'Кино',
    eventsList: [
      {
        index: 1,
        year: 1987,
        description: '«Хищник»/Predator, США (реж. Джон Мактирнан)',
      },
      {
        index: 2,
        year: 1988,
        description:
          '«Кто подставил кролика Роджера» /Who Framed Roger Rabbit, США (реж. Роберт Земекис)',
      },
      {
        index: 3,
        year: 1989,
        description:
          '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)',
      },
      {
        index: 4,
        year: 1990,
        description: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)',
      },
      {
        index: 5,
        year: 1991,
        description:
          '«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)',
      },
    ],
  },
  {
    index: 3,
    label: 'Литература',
    eventsList: [
      {
        index: 1,
        year: 1992,
        description:
          'Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах».',
      },
      {
        index: 2,
        year: 1994,
        description: '«Бессонница» - роман Стивена Кинга',
      },
      {
        index: 3,
        year: 1995,
        description: 'Нобелевская премия премия по литературе - Шеймас Хини',
      },
      {
        index: 4,
        year: 1997,
        description: '«Гарри Поттер и философский камень» - Джоан Роулинг.',
      },
    ],
  },
  {
    index: 4,
    label: 'Театр',
    eventsList: [
      {
        index: 1,
        year: 1999,
        description:
          'премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона',
      },
      {
        index: 2,
        year: 2000,
        description: 'Возобновлено издание журнала «Театр»',
      },
      {
        index: 3,
        year: 2002,
        description:
          'премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный Театр, Лондон',
      },
      {
        index: 4,
        year: 2003,
        description:
          'Премьера балета «Иван Грозный» в постановке Юрия Григоровича в здании Оперного театра на площади Бастилии',
      },
      {
        index: 5,
        year: 2004,
        description:
          'В Париже прошла премьера оперы «Трубадур» с Дмитрием Хворостовским в заглавной роли',
      },
    ],
  },
  {
    index: 5,
    label: 'Спорт',
    eventsList: [
      {
        index: 1,
        year: 2006,
        description:
          'Баскетбольный клуб ЦСКА стал победителем национального первенства России',
      },
      {
        index: 2,
        year: 2008,
        description:
          'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры',
      },
      {
        index: 3,
        year: 2010,
        description:
          '12 - 28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года.',
      },
      {
        index: 4,
        year: 2012,
        description: '2 августа - Летние Олимпийские игры.',
      },
      {
        index: 5,
        year: 2014,
        description: 'XXII зимние Олимпийские игры (Сочи, Россия).',
      },
    ],
  },
  {
    index: 6,
    label: 'Наука',
    eventsList: [
      {
        index: 1,
        year: 2015,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        index: 2,
        year: 2016,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        index: 3,
        year: 2017,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        index: 4,
        year: 2018,
        description:
          'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца',
      },
      {
        index: 5,
        year: 2019,
        description:
          'Google объявил о создании 53-кубитного квантового компьютера',
      },
      {
        index: 6,
        year: 2020,
        description:
          'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полета',
      },
      {
        index: 7,
        year: 2022,
        description: '....',
      },
    ],
  },
];

export { data };
